eDespatch/target/classes/wsdl/com/foriba/edespatch/ClientEDespatchServices-1/ClientEDespatchServices-1.0.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!-- ©2018 Foriba -->
<wsdl:definitions
	xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
	xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:tns="http://foriba.com/eDespatch/"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	xmlns:xs="http://www.w3.org/2001/XMLSchema"
	targetNamespace="http://foriba.com/eDespatch/">
	<wsdl:types>
		<xs:schema xmlns="http://www.w3.org/2001/XMLSchema"
			targetNamespace="http://foriba.com/eDespatch/">
			<xs:include
				schemaLocation="./Schemas/ClientEDespatchServicesTypes-1.0.xsd" />
			<xs:include
				schemaLocation="./Schemas/EDespatchServicesCommonTypes-1.0.xsd" />
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="sendDesUBLRequestMessage">
		<wsdl:part element="tns:sendDesUBLRequest" name="parameter" />
	</wsdl:message>
	<wsdl:message name="sendDesUBLResponseMessage">
		<wsdl:part element="tns:sendDesUBLResponse" name="parameter" />
	</wsdl:message>
	<wsdl:message name="sendDesUBLFaultMessage">
		<wsdl:part element="tns:ProcessingFault" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUBLListRequestMessage">
		<wsdl:part element="tns:getDesUBLListRequest"
			name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUBLListResponseMessage">
		<wsdl:part element="tns:getDesUBLListResponse"
			name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUBLListFaultMessage">
		<wsdl:part element="tns:ProcessingFault" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUBLRequestMessage">
		<wsdl:part element="tns:getDesUBLRequest" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUBLResponseMessage">
		<wsdl:part element="tns:getDesUBLResponse" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUBLFaultMessage">
		<wsdl:part element="tns:ProcessingFault" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesReceiptsRequestMessage">
		<wsdl:part element="tns:getDesReceiptsRequest"
			name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesReceiptsResponseMessage">
		<wsdl:part element="tns:getDesReceiptsResponse"
			name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesReceiptsFaultMessage">
		<wsdl:part element="tns:ProcessingFault" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesEnvelopeStatusRequestMessage">
		<wsdl:part element="tns:getDesEnvelopeStatusRequest"
			name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesEnvelopeStatusResponseMessage">
		<wsdl:part element="tns:getDesEnvelopeStatusResponse"
			name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesEnvelopeStatusFaultMessage">
		<wsdl:part element="tns:ProcessingFault" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesViewRequestMessage">
		<wsdl:part element="tns:getDesViewRequest" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesViewResponseMessage">
		<wsdl:part element="tns:getDesViewResponse" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesViewFaultMessage">
		<wsdl:part element="tns:ProcessingFault" name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUserListRequestMessage">
		<wsdl:part element="tns:getDesUserListRequest"
			name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUserListResponseMessage">
		<wsdl:part element="tns:getDesUserListResponse"
			name="parameter" />
	</wsdl:message>
	<wsdl:message name="getDesUserListFaultMessage">
		<wsdl:part element="tns:ProcessingFault" name="parameter" />
	</wsdl:message>
	<wsdl:portType name="ClientEDespatchServicesPort">
		<wsdl:operation name="sendDesUBL">
			<wsdl:input message="tns:sendDesUBLRequestMessage" />
			<wsdl:output message="tns:sendDesUBLResponseMessage" />
			<wsdl:fault message="tns:sendDesUBLFaultMessage"
				name="sendDesUBLFault" />
		</wsdl:operation>
		<wsdl:operation name="getDesUBLList">
			<wsdl:input message="tns:getDesUBLListRequestMessage" />
			<wsdl:output message="tns:getDesUBLListResponseMessage" />
			<wsdl:fault message="tns:getDesUBLListFaultMessage"
				name="getDesUBLListFault" />
		</wsdl:operation>
		<wsdl:operation name="getDesUBL">
			<wsdl:input message="tns:getDesUBLRequestMessage" />
			<wsdl:output message="tns:getDesUBLResponseMessage" />
			<wsdl:fault message="tns:getDesUBLFaultMessage"
				name="getDesUBLFault" />
		</wsdl:operation>
		<wsdl:operation name="getDesReceipts">
			<wsdl:input message="tns:getDesReceiptsRequestMessage" />
			<wsdl:output message="tns:getDesReceiptsResponseMessage" />
			<wsdl:fault message="tns:getDesReceiptsFaultMessage"
				name="getDesReceiptsFault" />
		</wsdl:operation>
		<wsdl:operation name="getDesEnvelopeStatus">
			<wsdl:input
				message="tns:getDesEnvelopeStatusRequestMessage" />
			<wsdl:output
				message="tns:getDesEnvelopeStatusResponseMessage" />
			<wsdl:fault message="tns:getDesEnvelopeStatusFaultMessage"
				name="getDesEnvelopeStatusFault" />
		</wsdl:operation>
		<wsdl:operation name="getDesView">
			<wsdl:input message="tns:getDesViewRequestMessage" />
			<wsdl:output message="tns:getDesViewResponseMessage" />
			<wsdl:fault message="tns:getDesViewFaultMessage"
				name="getDesViewFault" />
		</wsdl:operation>
		<wsdl:operation name="getDesUserList">
			<wsdl:input message="tns:getDesUserListRequestMessage" />
			<wsdl:output message="tns:getDesUserListResponseMessage" />
			<wsdl:fault message="tns:getDesUserListFaultMessage"
				name="getDesUserListFault" />
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="ClientEDespatchServicesBinding"
		type="tns:ClientEDespatchServicesPort">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="sendDesUBL">
			<soap:operation soapAction="sendDesUBL" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="sendDesUBLFault">
				<soap:fault name="sendDesUBLFault" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
		<wsdl:operation name="getDesUBLList">
			<soap:operation soapAction="getDesUBLList" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="getDesUBLListFault">
				<soap:fault name="getDesUBLListFault" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
		<wsdl:operation name="getDesUBL">
			<soap:operation soapAction="getDesUBL" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="getDesUBLFault">
				<soap:fault name="getDesUBLFault" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
		<wsdl:operation name="getDesReceipts">
			<soap:operation soapAction="getDesReceipts" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="getDesReceiptsFault">
				<soap:fault name="getDesReceiptsFault" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
		<wsdl:operation name="getDesEnvelopeStatus">
			<soap:operation soapAction="getDesEnvelopeStatus" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="getDesEnvelopeStatusFault">
				<soap:fault name="getDesEnvelopeStatusFault"
					use="literal" />
			</wsdl:fault>
		</wsdl:operation>
		<wsdl:operation name="getDesView">
			<soap:operation soapAction="getDesView" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="getDesViewFault">
				<soap:fault name="getDesViewFault" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
		<wsdl:operation name="getDesUserList">
			<soap:operation soapAction="getDesUserList" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="getDesUserListFault">
				<soap:fault name="getDesUserListFault" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="ClientEDespatchServices">
		<wsdl:port binding="tns:ClientEDespatchServicesBinding"
			name="ClientEDespatchServicesPort">
			<soap:address location="http://replaceWithActualURL" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
