Sovos_eIrsaliye/EK1 - Teknik Belgeler/SOAP/e-İrsaliye WS Soap İstek ve Yanıt Örnekleri/getDesUBL_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:edes="http://foriba.com/eDespatch/">
   <soapenv:Header/>
   <soapenv:Body>
      <edes:getDesUBLRequest>
         <edes:Identifier>urn:mail:defaultpk@fitcons.com</edes:Identifier>
         <edes:VKN_TCKN>3880718497</edes:VKN_TCKN>
         <!--1 or more repetitions:-->
         <edes:UUID>fb8b86ec-09cd-465c-ab53-f89ed24fa00f</edes:UUID>
         <edes:DocType>RECEIPT</edes:DocType>
         <edes:Type>OUTBOUND</edes:Type>
         <!--Zero or more repetitions:-->
         <edes:Parameters>?</edes:Parameters>
      </edes:getDesUBLRequest>
   </soapenv:Body>
</soapenv:Envelope>